{"What is Retrieval Augmented Generation?": [{"text": "Human cognition is constrained by processing limitations, leading to cognitive overload and inefficiencies in knowledge synthesis and decision-making. Large Language Models (LLMs) present an opportunity for cognitive augmentation, but their current reactive nature limits their real-world applicability. This position paper explores the potential of context-aware cognitive augmentation, where LLMs dynamically adapt to users' cognitive states and task environments to provide appropriate support. Through a think-aloud study in an exhibition setting, we examine how individuals interact with multi-modal information and identify key cognitive challenges in structuring, retrieving, and applying knowledge. Our findings highlight the need for AI-driven cognitive support systems that integrate real-time contextual awareness, personalized reasoning assistance, and socially adaptive interactions. We propose a framework for AI augmentation that seamlessly transitions between real-time cognitive support and post-experience knowledge organization, contributing to the design of more effective human-centered AI systems.", "file": "Intelligent Interaction Strategies for Context-Aware Cognitive Augmentation (2025)", "score": 0.95, "rank": 1, "url": "https://arxiv.org/pdf/2504.13684v1", "type": "online"}, {"text": "Wearable devices are transforming human capabilities by seamlessly augmenting cognitive functions. In this position paper, we propose a voice-based, interactive learning companion designed to amplify and extend cognitive abilities through informal learning. Our vision is threefold: (1) to enable users to discover new knowledge on-the-go through contextual interactive quizzes, fostering critical thinking and mindfulness, (2) to proactively detect misinformation, empowering users to critically assess information in real time, and (3) to provide spoken language correction and prompting hints for second language learning and effective communication. As an initial step toward this vision, we present Factually - a proactive, wearable fact-checking system integrated into devices like smartwatches or rings. Factually discreetly alerts users to potential falsehoods via vibrotactile feedback, helping them assess information critically. We demonstrate its utility through three illustrative scenarios, highlighting its potential to extend cognitive abilities for real-time misinformation detection. Early qualitative feedback suggests that Factually can enhance users' fact-checking capabilities, offering both practical and experiential benefits.", "file": "Factually: Exploring Wearable Fact-Checking for Augmented Truth Discernment (2025)", "score": 0.95, "rank": 2, "url": "https://arxiv.org/pdf/2504.17204v1", "type": "online"}, {"text": "The recent rapid advancement of LLM-based AI systems has accelerated our search and production of information. While the advantages brought by these systems seemingly improve the performance or efficiency of human activities, they do not necessarily enhance human capabilities. Recent research has started to examine the impact of generative AI on individuals' cognitive abilities, especially critical thinking. Based on definitions of critical thinking across psychology and education, this position paper proposes the distinction between demonstrated and performed critical thinking in the era of generative AI and discusses the implication of this distinction in research and development of AI systems that aim to augment human critical thinking.", "file": "Designing AI Systems that Augment Human Performed vs. Demonstrated Critical Thinking (2025)", "score": 0.95, "rank": 3, "url": "https://arxiv.org/pdf/2504.14689v1", "type": "online"}, {"text": "We introduce Autoregressive Retrieval Augmentation (AR-RAG), a novel paradigm that enhances image generation by autoregressively incorporating knearest neighbor retrievals at the patch level. Unlike prior methods that perform a single, static retrieval before generation and condition the entire generation on fixed reference images, AR-RAG performs context-aware retrievals at each generation step, using prior-generated patches as queries to retrieve and incorporate the most relevant patch-level visual references, enabling the model to respond to evolving generation needs while avoiding limitations (e.g., over-copying, stylistic bias, etc.) prevalent in existing methods. To realize AR-RAG, we propose two parallel frameworks: (1) Distribution-Augmentation in Decoding (DAiD), a training-free plug-and-use decoding strategy that directly merges the distribution of model-predicted patches with the distribution of retrieved patches, and (2) Feature-Augmentation in Decoding (FAiD), a parameter-efficient fine-tuning method that progressively smooths the features of retrieved patches via multi-scale convolution operations and leverages them to augment the image generation process. We validate the effectiveness of AR-RAG on widely adopted benchmarks, including Midjourney-30K, GenEval and DPG-Bench, demonstrating significant performance gains over state-of-the-art image generation models.", "file": "AR-RAG: Autoregressive Retrieval Augmentation for Image Generation (2025)", "score": 0.95, "rank": 4, "url": "https://arxiv.org/pdf/2506.06962v3", "type": "online"}, {"text": "Many questions cannot be answered simply; their answers must include numerous nuanced details and additional context. Complex Answer Retrieval (CAR) is the retrieval of answers to such questions. In their simplest form, these questions are constructed from a topic entity (e.g., `cheese') and a facet (e.g., `health effects'). While topic matching has been thoroughly explored, we observe that some facets use general language that is unlikely to appear verbatim in answers. We call these low-utility facets. In this work, we present an approach to CAR that identifies and addresses low-utility facets. We propose two estimators of facet utility. These include exploiting the hierarchical structure of CAR queries and using facet frequency information from training data. To improve the retrieval performance on low-utility headings, we also include entity similarity scores using knowledge graph embeddings. We apply our approaches to a leading neural ranking technique, and evaluate using the TREC CAR dataset. We find that our approach perform significantly better than the unmodified neural ranker and other leading CAR techniques. We also provide a detailed analysis of our results, and verify that low-utility facets are indeed more difficult to match, and that our approach improves the performance for these difficult queries.", "file": "Overcoming low-utility facets for complex answer retrieval (2018)", "score": 0.95, "rank": 5, "url": "https://arxiv.org/pdf/1811.08772v1", "type": "online"}], "what is ANN models": [{"text": "The series of meetings ``What comes beyond the Standard Models'' started in 1998 with the idea of organizing a workshop where participants would spend most of the time in discussions, confronting different approaches and ideas.\n  The idea was successful and has developed into an annual workshop, which is taking place every year since 1998. Very open-minded and fruitful discussions have become the trademark of our workshops, producing several published works.\n  We discussed a lot of concepts which could help to understand our universe from the level of the second quantized elementary fermion and boson fields up to the level of the born of our universe.", "file": "Proceedings to the 27th Workshop \"What Comes Beyond the Standard Models\" Bled, July 8-17, 2024 (2025)", "score": 0.95, "rank": 1, "url": "https://arxiv.org/pdf/2504.17803v1", "type": "online"}, {"text": "The 2023 Big ANN Challenge, held at NeurIPS 2023, focused on advancing the state-of-the-art in indexing data structures and search algorithms for practical variants of Approximate Nearest Neighbor (ANN) search that reflect the growing complexity and diversity of workloads. Unlike prior challenges that emphasized scaling up classical ANN search ~\\cite{DBLP:conf/nips/SimhadriWADBBCH21}, this competition addressed filtered search, out-of-distribution data, sparse and streaming variants of ANNS. Participants developed and submitted innovative solutions that were evaluated on new standard datasets with constrained computational resources. The results showcased significant improvements in search accuracy and efficiency over industry-standard baselines, with notable contributions from both academic and industrial teams. This paper summarizes the competition tracks, datasets, evaluation metrics, and the innovative approaches of the top-performing submissions, providing insights into the current advancements and future directions in the field of approximate nearest neighbor search.", "file": "Results of the Big ANN: NeurIPS'23 competition (2024)", "score": 0.95, "rank": 2, "url": "https://arxiv.org/pdf/2409.17424v1", "type": "online"}, {"text": "This work continues the construction of a recently proposed model of dark matter stars. In this model, dark matter quanta are sterile massless particles that are emitted from the central regions of the galaxy in the radial direction. As a result, at large distances $r$ from the center of the galaxy, the mass density of dark matter has the form $ρ\\sim r^{-2}$, in contrast to the homogeneous model $ρ=Const$. In the cosmological context, the homogeneous model with massless particles corresponds to the radiation epoch of the expansion of the universe, while the proposed inhomogeneous model turns out to be equivalent to $Λ$CDM. In this paper, scenarios will be considered in which the radial emission of dark matter is brought into hydrostatic equilibrium with a uniform background. It is shown that solutions exist if the uniform background has an equation of state typical for dark energy. Thus, this model describes a phase transition from dark matter inside the galaxy to dark energy outside of it. The specific mechanism for such a transition could be Bose-Einstein condensation. In addition, the question of what happens if dark matter particles are not sterile, for example, are photons of the Standard Model, is considered.", "file": "Galactic model with a phase transition from dark matter to dark energy (2021)", "score": 0.95, "rank": 3, "url": "https://arxiv.org/pdf/2110.00366v1", "type": "online"}, {"text": "In this paper, research on AI based modeling technique to optimize development of new alloys with necessitated improvements in properties and chemical mixture over existing alloys as per functional requirements of product is done. The current research work novels AI in lieu of predictions to establish association between material and product customary. Advanced computational simulation techniques like CFD, FEA interrogations are made viable to authenticate product dynamics in context to experimental investigations. Accordingly, the current research is focused towards binding relationships between material design and product design domains. The input to feed forward back propagation prediction network model constitutes of material design features. Parameters relevant to product design strategies are furnished as target outputs. The outcomes of ANN shows good sign of correlation between material and product design domains. The study enriches a new path to illustrate material factors at the time of new product development.", "file": "Establishment of Relationships between Material Design and Product Design Domains by Hybrid FEM-ANN Technique (2010)", "score": 0.95, "rank": 4, "url": "https://arxiv.org/pdf/1002.1157v1", "type": "online"}, {"text": "Recommender systems have gained increasing attention to personalise consumer preferences. While these systems have primarily focused on applications such as advertisement recommendations (e.g., Google), personalized suggestions (e.g., Netflix and Spotify), and retail selection (e.g., Amazon), there is potential for these systems to benefit from a more global, socio-economic, and culturally aware approach, particularly as companies seek to expand into diverse markets. This paper aims to investigate the potential of a recommender system that considers cultural identity and socio-economic factors. We review the most recent developments in recommender systems and explore the impact of cultural identity and socio-economic factors on consumer preferences. We then propose an ontology and approach for incorporating these factors into recommender systems. To illustrate the potential of our approach, we present a scenario in consumer subscription plan selection within the entertainment industry. We argue that existing recommender systems have limited ability to precisely understand user preferences due to a lack of awareness of socio-economic factors and cultural identity. They also fail to update recommendations in response to changing socio-economic conditions. We explore various machine learning models and develop a final artificial neural network model (ANN) that addresses this gap. We evaluate the effectiveness of socio-economic and culturally aware recommender systems across four dimensions: Precision, Accuracy, F1, and Recall. We find that a highly tuned ANN model incorporating domain-specific data, select cultural indices and relevant socio-economic factors predicts user preference in subscriptions with an accuracy of 95%, a precision of 94%, a F1 Score of 92\\%, and a Recall of 90\\%.", "file": "Towards Global, Socio-Economic, and Culturally Aware Recommender Systems (2023)", "score": 0.95, "rank": 5, "url": "https://arxiv.org/pdf/2312.05805v1", "type": "online"}]}